app/controllers/admin/users_controller.rb

INSERT INTO "users" ("email", "firstname", "lastname", "password_digest", "admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "users" SET "lastname" = ?, "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["lastname", "lastname"], ["admin", "f"], ["updated_at", "2016-03-30 19:41:29.123495"], ["id", 4]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)