app/controllers/movies_controller.rb

  def create
     @movie = Movie.new(movie_params)

     if @movie.save
---
INSERT INTO "movies" ("title", "release_date", "director", "runtime_in_minutes", "poster_file_name", "poster_content_type", "poster_file_size", "poster_updated_at", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)